#Написать программу, которая будет запрашивать у пользователя две строки с помощью
#инпутов, а затем производить их конкатенацию.

# Запрашиваем у пользователя первую строку
string1 = input("Введите первую строку: ")

# Запрашиваем у пользователя вторую строку
string2 = input("Введите вторую строку: ")

# Выполняем конкатенацию строк
result = string1 + string2

# Выводим результат
print("Результат конкатенации:", result)
