#Создайте два множества, объедините их и выведите результат

# Создаем два множества
set1 = {1, 2, 3, 4}
set2 = {3, 4, 5, 6}

# Объединяем множества
union_set = set1.union(set2)

# Или можно использовать оператор |
# union_set = set1 | set2

# Выводим результат
print("Объединенное множество:", union_set)
